zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT758S/MIMXRT758S_ezhv_COMMON.h
/*
** ###################################################################
**     Processors:          MIMXRT758SGAWBR_ezhv
**                          MIMXRT758SGFOB_ezhv
**                          MIMXRT758SGVKB_ezhv
**
**     Reference manual:    iMXRT700RM Rev.5, 10/2025
**     Version:             rev. 6.0, 2025-12-29
**     Build:               b260429
**
**     Abstract:
**         Peripheral Access Layer for MIMXRT758S_ezhv
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2022-09-15)
**         Initial version.
**     - rev. 2.0 (2024-05-28)
**         Rev2 DraftA.
**     - rev. 3.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**     - rev. 4.0 (2025-06-06)
**         B0 initial version
**     - rev. 5.0 (2025-11-13)
**         Add puf/sdadc irq and cache64 compatibility macros to common header.
**     - rev. 5.1 (2025-12-08)
**         Update RM version and add pdm irq for hifi1/hifi4.
**     - rev. 6.0 (2025-12-29)
**         Add new part number.
**
** ###################################################################
*/

/*!
 * @file MIMXRT758S_ezhv_COMMON.h
 * @version 6.0
 * @date 2025-12-29
 * @brief Peripheral Access Layer for MIMXRT758S_ezhv
 *
 * Peripheral Access Layer for MIMXRT758S_ezhv
 */

#if !defined(MIMXRT758S_EZHV_COMMON_H_)
#define MIMXRT758S_EZHV_COMMON_H_                /**< Symbol preventing repeated inclusion */

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0600U
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0000U

/* ----------------------------------------------------------------------------
   --
   ---------------------------------------------------------------------------- */

#include "core_zv2116.h"
#include "system_MIMXRT758S_ezhv.h"     /* Device specific configuration file */



/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_VECTORS 1                  /**< Number of interrupts in the Vector table */

typedef enum IRQn {
  /* Auxiliary constants */
  NotAvail_IRQn                = -128,             /**< Not available device specific interrupt */

  /* Device specific interrupts */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Cortex EZHV Core Configuration
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Cortex_Core_Configuration Cortex EZHV Core Configuration
 * @{
 */

#define __MPU_PRESENT                  0         /**< Defines if an MPU is present or not */
#define __NVIC_PRIO_BITS               3         /**< Number of priority bits implemented in the NVIC */
#define __Vendor_SysTickConfig         0         /**< Vendor specific implementation of SysTickConfig is defined */
#define __FPU_PRESENT                  0         /**< Defines if an FPU is present or not */
#define __DSP_PRESENT                  0         /**< Defines if Armv8-M Mainline core supports DSP instructions */
#define __SAUREGION_PRESENT            1         /**< Defines if an SAU is present or not */

/*!
 * @}
 */ /* end of group Cortex_Core_Configuration */


#ifndef MIMXRT758S_ezhv_SERIES
#define MIMXRT758S_ezhv_SERIES
#endif
/* CPU specific feature definitions */
#include "MIMXRT758S_ezhv_features.h"

/* ADC - Peripheral instance base addresses */
/** Peripheral ADC0 base address */
#define ADC0_BASE                                (0x4020C000u)
/** Peripheral ADC0 base pointer */
#define ADC0                                     ((ADC_Type *)ADC0_BASE)
/** Array initializer of ADC peripheral base addresses */
#define ADC_BASE_ADDRS                           { ADC0_BASE }
/** Array initializer of ADC peripheral base pointers */
#define ADC_BASE_PTRS                            { ADC0 }

/* AHBSC0 - Peripheral instance base addresses */
/** Peripheral AHBSC0 base address */
#define AHBSC0_BASE                              (0x4017C000u)
/** Peripheral AHBSC0 base pointer */
#define AHBSC0                                   ((AHBSC0_Type *)AHBSC0_BASE)
/** Peripheral AHBSC0_ALIAS1 base address */
#define AHBSC0_ALIAS1_BASE                       (0x4017D000u)
/** Peripheral AHBSC0_ALIAS1 base pointer */
#define AHBSC0_ALIAS1                            ((AHBSC0_Type *)AHBSC0_ALIAS1_BASE)
/** Peripheral AHBSC0_ALIAS2 base address */
#define AHBSC0_ALIAS2_BASE                       (0x4017E000u)
/** Peripheral AHBSC0_ALIAS2 base pointer */
#define AHBSC0_ALIAS2                            ((AHBSC0_Type *)AHBSC0_ALIAS2_BASE)
/** Peripheral AHBSC0_ALIAS3 base address */
#define AHBSC0_ALIAS3_BASE                       (0x4017F000u)
/** Peripheral AHBSC0_ALIAS3 base pointer */
#define AHBSC0_ALIAS3                            ((AHBSC0_Type *)AHBSC0_ALIAS3_BASE)
/** Array initializer of AHBSC0 peripheral base addresses */
#define AHBSC0_BASE_ADDRS                        { AHBSC0_BASE, AHBSC0_ALIAS1_BASE, AHBSC0_ALIAS2_BASE, AHBSC0_ALIAS3_BASE }
/** Array initializer of AHBSC0 peripheral base pointers */
#define AHBSC0_BASE_PTRS                         { AHBSC0, AHBSC0_ALIAS1, AHBSC0_ALIAS2, AHBSC0_ALIAS3 }

/* AHBSC3 - Peripheral instance base addresses */
/** Peripheral AHBSC3 base address */
#define AHBSC3_BASE                              (0x40220000u)
/** Peripheral AHBSC3 base pointer */
#define AHBSC3                                   ((AHBSC3_Type *)AHBSC3_BASE)
/** Peripheral AHBSC3_ALIAS1 base address */
#define AHBSC3_ALIAS1_BASE                       (0x40221000u)
/** Peripheral AHBSC3_ALIAS1 base pointer */
#define AHBSC3_ALIAS1                            ((AHBSC3_Type *)AHBSC3_ALIAS1_BASE)
/** Peripheral AHBSC3_ALIAS2 base address */
#define AHBSC3_ALIAS2_BASE                       (0x40222000u)
/** Peripheral AHBSC3_ALIAS2 base pointer */
#define AHBSC3_ALIAS2                            ((AHBSC3_Type *)AHBSC3_ALIAS2_BASE)
/** Peripheral AHBSC3_ALIAS3 base address */
#define AHBSC3_ALIAS3_BASE                       (0x40223000u)
/** Peripheral AHBSC3_ALIAS3 base pointer */
#define AHBSC3_ALIAS3                            ((AHBSC3_Type *)AHBSC3_ALIAS3_BASE)
/** Array initializer of AHBSC3 peripheral base addresses */
#define AHBSC3_BASE_ADDRS                        { AHBSC3_BASE, AHBSC3_ALIAS1_BASE, AHBSC3_ALIAS2_BASE, AHBSC3_ALIAS3_BASE }
/** Array initializer of AHBSC3 peripheral base pointers */
#define AHBSC3_BASE_PTRS                         { AHBSC3, AHBSC3_ALIAS1, AHBSC3_ALIAS2, AHBSC3_ALIAS3 }

/* AHBSC4 - Peripheral instance base addresses */
/** Peripheral AHBSC4 base address */
#define AHBSC4_BASE                              (0x40400000u)
/** Peripheral AHBSC4 base pointer */
#define AHBSC4                                   ((AHBSC4_Type *)AHBSC4_BASE)
/** Peripheral AHBSC4_ALIAS1 base address */
#define AHBSC4_ALIAS1_BASE                       (0x40401000u)
/** Peripheral AHBSC4_ALIAS1 base pointer */
#define AHBSC4_ALIAS1                            ((AHBSC4_Type *)AHBSC4_ALIAS1_BASE)
/** Peripheral AHBSC4_ALIAS2 base address */
#define AHBSC4_ALIAS2_BASE                       (0x40402000u)
/** Peripheral AHBSC4_ALIAS2 base pointer */
#define AHBSC4_ALIAS2                            ((AHBSC4_Type *)AHBSC4_ALIAS2_BASE)
/** Peripheral AHBSC4_ALIAS3 base address */
#define AHBSC4_ALIAS3_BASE                       (0x40403000u)
/** Peripheral AHBSC4_ALIAS3 base pointer */
#define AHBSC4_ALIAS3                            ((AHBSC4_Type *)AHBSC4_ALIAS3_BASE)
/** Array initializer of AHBSC4 peripheral base addresses */
#define AHBSC4_BASE_ADDRS                        { AHBSC4_BASE, AHBSC4_ALIAS1_BASE, AHBSC4_ALIAS2_BASE, AHBSC4_ALIAS3_BASE }
/** Array initializer of AHBSC4 peripheral base pointers */
#define AHBSC4_BASE_PTRS                         { AHBSC4, AHBSC4_ALIAS1, AHBSC4_ALIAS2, AHBSC4_ALIAS3 }

/* CACHE64_CTRL - Peripheral instance base addresses */
/** Peripheral CACHE64_CTRL0 base address */
#define CACHE64_CTRL0_BASE                       (0x40035000u)
/** Peripheral CACHE64_CTRL0 base pointer */
#define CACHE64_CTRL0                            ((CACHE64_CTRL_Type *)CACHE64_CTRL0_BASE)
/** Peripheral CACHE64_CTRL1 base address */
#define CACHE64_CTRL1_BASE                       (0x40036000u)
/** Peripheral CACHE64_CTRL1 base pointer */
#define CACHE64_CTRL1                            ((CACHE64_CTRL_Type *)CACHE64_CTRL1_BASE)
/** Array initializer of CACHE64_CTRL peripheral base addresses */
#define CACHE64_CTRL_BASE_ADDRS                  { CACHE64_CTRL0_BASE, CACHE64_CTRL1_BASE }
/** Array initializer of CACHE64_CTRL peripheral base pointers */
#define CACHE64_CTRL_BASE_PTRS                   { CACHE64_CTRL0, CACHE64_CTRL1 }
/** CACHE64_CTRL physical memory base address */
 #define CACHE64_CTRL_PHYMEM_BASES                { 0x28000000u, 0x08000000u }
/** CACHE64_CTRL physical memory size */
 #define CACHE64_CTRL_PHYMEM_SIZES                { 0x08000000u, 0x08000000u }
/* Backward compatibility */
#define CACHE64_CTRL_CSAR_PHYADDR_MASK (CACHE64_CTRL_CSAR_PHYADDR27_1_MASK | CACHE64_CTRL_CSAR_PHYADDR31_29_MASK)
#ifdef FSL_FEATURE_CACHE64_CTRL_LINESIZE_BYTE
#undef FSL_FEATURE_CACHE64_LINESIZE_BYTE
#define FSL_FEATURE_CACHE64_LINESIZE_BYTE FSL_FEATURE_CACHE64_CTRL_LINESIZE_BYTE
#endif


/* CACHE64_POLSEL - Peripheral instance base addresses */
/** Peripheral CACHE64_POLSEL0 base address */
#define CACHE64_POLSEL0_BASE                     (0x40035000u)
/** Peripheral CACHE64_POLSEL0 base pointer */
#define CACHE64_POLSEL0                          ((CACHE64_POLSEL_Type *)CACHE64_POLSEL0_BASE)
/** Peripheral CACHE64_POLSEL1 base address */
#define CACHE64_POLSEL1_BASE                     (0x40036000u)
/** Peripheral CACHE64_POLSEL1 base pointer */
#define CACHE64_POLSEL1                          ((CACHE64_POLSEL_Type *)CACHE64_POLSEL1_BASE)
/** Array initializer of CACHE64_POLSEL peripheral base addresses */
#define CACHE64_POLSEL_BASE_ADDRS                { CACHE64_POLSEL0_BASE, CACHE64_POLSEL1_BASE }
/** Array initializer of CACHE64_POLSEL peripheral base pointers */
#define CACHE64_POLSEL_BASE_PTRS                 { CACHE64_POLSEL0, CACHE64_POLSEL1 }

/* CDOG - Peripheral instance base addresses */
/** Peripheral CDOG0 base address */
#define CDOG0_BASE                               (0x40115000u)
/** Peripheral CDOG0 base pointer */
#define CDOG0                                    ((CDOG_Type *)CDOG0_BASE)
/** Peripheral CDOG1 base address */
#define CDOG1_BASE                               (0x40116000u)
/** Peripheral CDOG1 base pointer */
#define CDOG1                                    ((CDOG_Type *)CDOG1_BASE)
/** Peripheral CDOG2 base address */
#define CDOG2_BASE                               (0x40117000u)
/** Peripheral CDOG2 base pointer */
#define CDOG2                                    ((CDOG_Type *)CDOG2_BASE)
/** Peripheral CDOG3 base address */
#define CDOG3_BASE                               (0x4032B000u)
/** Peripheral CDOG3 base pointer */
#define CDOG3                                    ((CDOG_Type *)CDOG3_BASE)
/** Peripheral CDOG4 base address */
#define CDOG4_BASE                               (0x4032A000u)
/** Peripheral CDOG4 base pointer */
#define CDOG4                                    ((CDOG_Type *)CDOG4_BASE)
/** Array initializer of CDOG peripheral base addresses */
#define CDOG_BASE_ADDRS                          { CDOG0_BASE, CDOG1_BASE, CDOG2_BASE, CDOG3_BASE, CDOG4_BASE }
/** Array initializer of CDOG peripheral base pointers */
#define CDOG_BASE_PTRS                           { CDOG0, CDOG1, CDOG2, CDOG3, CDOG4 }

/* CLKCTL0 - Peripheral instance base addresses */
/** Peripheral CLKCTL0 base address */
#define CLKCTL0_BASE                             (0x40001000u)
/** Peripheral CLKCTL0 base pointer */
#define CLKCTL0                                  ((CLKCTL0_Type *)CLKCTL0_BASE)
/** Array initializer of CLKCTL0 peripheral base addresses */
#define CLKCTL0_BASE_ADDRS                       { CLKCTL0_BASE }
/** Array initializer of CLKCTL0 peripheral base pointers */
#define CLKCTL0_BASE_PTRS                        { CLKCTL0 }

/* CLKCTL1 - Peripheral instance base addresses */
/** Peripheral CLKCTL1 base address */
#define CLKCTL1_BASE                             (0x40041000u)
/** Peripheral CLKCTL1 base pointer */
#define CLKCTL1                                  ((CLKCTL1_Type *)CLKCTL1_BASE)
/** Array initializer of CLKCTL1 peripheral base addresses */
#define CLKCTL1_BASE_ADDRS                       { CLKCTL1_BASE }
/** Array initializer of CLKCTL1 peripheral base pointers */
#define CLKCTL1_BASE_PTRS                        { CLKCTL1 }

