zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT758S/MIMXRT758S_ezhv_COMMON.h
/* LPSPI - Peripheral instance base addresses */
/** Peripheral LPSPI0 base address */
#define LPSPI0_BASE                              (0x40110000u)
/** Peripheral LPSPI0 base pointer */
#define LPSPI0                                   ((LPSPI_Type *)LPSPI0_BASE)
/** Peripheral LPSPI1 base address */
#define LPSPI1_BASE                              (0x40111000u)
/** Peripheral LPSPI1 base pointer */
#define LPSPI1                                   ((LPSPI_Type *)LPSPI1_BASE)
/** Peripheral LPSPI2 base address */
#define LPSPI2_BASE                              (0x40112000u)
/** Peripheral LPSPI2 base pointer */
#define LPSPI2                                   ((LPSPI_Type *)LPSPI2_BASE)
/** Peripheral LPSPI3 base address */
#define LPSPI3_BASE                              (0x40113000u)
/** Peripheral LPSPI3 base pointer */
#define LPSPI3                                   ((LPSPI_Type *)LPSPI3_BASE)
/** Peripheral LPSPI4 base address */
#define LPSPI4_BASE                              (0x40171000u)
/** Peripheral LPSPI4 base pointer */
#define LPSPI4                                   ((LPSPI_Type *)LPSPI4_BASE)
/** Peripheral LPSPI5 base address */
#define LPSPI5_BASE                              (0x40172000u)
/** Peripheral LPSPI5 base pointer */
#define LPSPI5                                   ((LPSPI_Type *)LPSPI5_BASE)
/** Peripheral LPSPI6 base address */
#define LPSPI6_BASE                              (0x40173000u)
/** Peripheral LPSPI6 base pointer */
#define LPSPI6                                   ((LPSPI_Type *)LPSPI6_BASE)
/** Peripheral LPSPI7 base address */
#define LPSPI7_BASE                              (0x40174000u)
/** Peripheral LPSPI7 base pointer */
#define LPSPI7                                   ((LPSPI_Type *)LPSPI7_BASE)
/** Peripheral LPSPI8 base address */
#define LPSPI8_BASE                              (0x40199000u)
/** Peripheral LPSPI8 base pointer */
#define LPSPI8                                   ((LPSPI_Type *)LPSPI8_BASE)
/** Peripheral LPSPI9 base address */
#define LPSPI9_BASE                              (0x4019A000u)
/** Peripheral LPSPI9 base pointer */
#define LPSPI9                                   ((LPSPI_Type *)LPSPI9_BASE)
/** Peripheral LPSPI10 base address */
#define LPSPI10_BASE                             (0x4019B000u)
/** Peripheral LPSPI10 base pointer */
#define LPSPI10                                  ((LPSPI_Type *)LPSPI10_BASE)
/** Peripheral LPSPI11 base address */
#define LPSPI11_BASE                             (0x4019C000u)
/** Peripheral LPSPI11 base pointer */
#define LPSPI11                                  ((LPSPI_Type *)LPSPI11_BASE)
/** Peripheral LPSPI12 base address */
#define LPSPI12_BASE                             (0x4019D000u)
/** Peripheral LPSPI12 base pointer */
#define LPSPI12                                  ((LPSPI_Type *)LPSPI12_BASE)
/** Peripheral LPSPI13 base address */
#define LPSPI13_BASE                             (0x4019E000u)
/** Peripheral LPSPI13 base pointer */
#define LPSPI13                                  ((LPSPI_Type *)LPSPI13_BASE)
/** Peripheral LPSPI14 base address */
#define LPSPI14_BASE                             (0x40484000u)
/** Peripheral LPSPI14 base pointer */
#define LPSPI14                                  ((LPSPI_Type *)LPSPI14_BASE)
/** Peripheral LPSPI16 base address */
#define LPSPI16_BASE                             (0x40405000u)
/** Peripheral LPSPI16 base pointer */
#define LPSPI16                                  ((LPSPI_Type *)LPSPI16_BASE)
/** Peripheral LPSPI17 base address */
#define LPSPI17_BASE                             (0x40326000u)
/** Peripheral LPSPI17 base pointer */
#define LPSPI17                                  ((LPSPI_Type *)LPSPI17_BASE)
/** Peripheral LPSPI18 base address */
#define LPSPI18_BASE                             (0x40327000u)
/** Peripheral LPSPI18 base pointer */
#define LPSPI18                                  ((LPSPI_Type *)LPSPI18_BASE)
/** Peripheral LPSPI19 base address */
#define LPSPI19_BASE                             (0x40328000u)
/** Peripheral LPSPI19 base pointer */
#define LPSPI19                                  ((LPSPI_Type *)LPSPI19_BASE)
/** Peripheral LPSPI20 base address */
#define LPSPI20_BASE                             (0x40329000u)
/** Peripheral LPSPI20 base pointer */
#define LPSPI20                                  ((LPSPI_Type *)LPSPI20_BASE)
/** Array initializer of LPSPI peripheral base addresses */
#define LPSPI_BASE_ADDRS                         { LPSPI0_BASE, LPSPI1_BASE, LPSPI2_BASE, LPSPI3_BASE, LPSPI4_BASE, LPSPI5_BASE, LPSPI6_BASE, LPSPI7_BASE, LPSPI8_BASE, LPSPI9_BASE, LPSPI10_BASE, LPSPI11_BASE, LPSPI12_BASE, LPSPI13_BASE, LPSPI14_BASE, 0u, LPSPI16_BASE, LPSPI17_BASE, LPSPI18_BASE, LPSPI19_BASE, LPSPI20_BASE }
/** Array initializer of LPSPI peripheral base pointers */
#define LPSPI_BASE_PTRS                          { LPSPI0, LPSPI1, LPSPI2, LPSPI3, LPSPI4, LPSPI5, LPSPI6, LPSPI7, LPSPI8, LPSPI9, LPSPI10, LPSPI11, LPSPI12, LPSPI13, LPSPI14, (LPSPI_Type *)0u, LPSPI16, LPSPI17, LPSPI18, LPSPI19, LPSPI20 }

/* LPUART - Peripheral instance base addresses */
/** Peripheral LPUART0 base address */
#define LPUART0_BASE                             (0x40110000u)
/** Peripheral LPUART0 base pointer */
#define LPUART0                                  ((LPUART_Type *)LPUART0_BASE)
/** Peripheral LPUART1 base address */
#define LPUART1_BASE                             (0x40111000u)
/** Peripheral LPUART1 base pointer */
#define LPUART1                                  ((LPUART_Type *)LPUART1_BASE)
/** Peripheral LPUART2 base address */
#define LPUART2_BASE                             (0x40112000u)
/** Peripheral LPUART2 base pointer */
#define LPUART2                                  ((LPUART_Type *)LPUART2_BASE)
/** Peripheral LPUART3 base address */
#define LPUART3_BASE                             (0x40113000u)
/** Peripheral LPUART3 base pointer */
#define LPUART3                                  ((LPUART_Type *)LPUART3_BASE)
/** Peripheral LPUART4 base address */
#define LPUART4_BASE                             (0x40171000u)
/** Peripheral LPUART4 base pointer */
#define LPUART4                                  ((LPUART_Type *)LPUART4_BASE)
/** Peripheral LPUART5 base address */
#define LPUART5_BASE                             (0x40172000u)
/** Peripheral LPUART5 base pointer */
#define LPUART5                                  ((LPUART_Type *)LPUART5_BASE)
/** Peripheral LPUART6 base address */
#define LPUART6_BASE                             (0x40173000u)
/** Peripheral LPUART6 base pointer */
#define LPUART6                                  ((LPUART_Type *)LPUART6_BASE)
/** Peripheral LPUART7 base address */
#define LPUART7_BASE                             (0x40174000u)
/** Peripheral LPUART7 base pointer */
#define LPUART7                                  ((LPUART_Type *)LPUART7_BASE)
/** Peripheral LPUART8 base address */
#define LPUART8_BASE                             (0x40199000u)
/** Peripheral LPUART8 base pointer */
#define LPUART8                                  ((LPUART_Type *)LPUART8_BASE)
/** Peripheral LPUART9 base address */
#define LPUART9_BASE                             (0x4019A000u)
/** Peripheral LPUART9 base pointer */
#define LPUART9                                  ((LPUART_Type *)LPUART9_BASE)
/** Peripheral LPUART10 base address */
#define LPUART10_BASE                            (0x4019B000u)
/** Peripheral LPUART10 base pointer */
#define LPUART10                                 ((LPUART_Type *)LPUART10_BASE)
/** Peripheral LPUART11 base address */
#define LPUART11_BASE                            (0x4019C000u)
/** Peripheral LPUART11 base pointer */
#define LPUART11                                 ((LPUART_Type *)LPUART11_BASE)
/** Peripheral LPUART12 base address */
#define LPUART12_BASE                            (0x4019D000u)
/** Peripheral LPUART12 base pointer */
#define LPUART12                                 ((LPUART_Type *)LPUART12_BASE)
/** Peripheral LPUART13 base address */
#define LPUART13_BASE                            (0x4019E000u)
/** Peripheral LPUART13 base pointer */
#define LPUART13                                 ((LPUART_Type *)LPUART13_BASE)
/** Peripheral LPUART17 base address */
#define LPUART17_BASE                            (0x40326000u)
/** Peripheral LPUART17 base pointer */
#define LPUART17                                 ((LPUART_Type *)LPUART17_BASE)
/** Peripheral LPUART18 base address */
#define LPUART18_BASE                            (0x40327000u)
/** Peripheral LPUART18 base pointer */
#define LPUART18                                 ((LPUART_Type *)LPUART18_BASE)
/** Peripheral LPUART19 base address */
#define LPUART19_BASE                            (0x40328000u)
/** Peripheral LPUART19 base pointer */
#define LPUART19                                 ((LPUART_Type *)LPUART19_BASE)
/** Peripheral LPUART20 base address */
#define LPUART20_BASE                            (0x40329000u)
/** Peripheral LPUART20 base pointer */
#define LPUART20                                 ((LPUART_Type *)LPUART20_BASE)
/** Array initializer of LPUART peripheral base addresses */
#define LPUART_BASE_ADDRS                        { LPUART0_BASE, LPUART1_BASE, LPUART2_BASE, LPUART3_BASE, LPUART4_BASE, LPUART5_BASE, LPUART6_BASE, LPUART7_BASE, LPUART8_BASE, LPUART9_BASE, LPUART10_BASE, LPUART11_BASE, LPUART12_BASE, LPUART13_BASE, 0u, 0u, 0u, LPUART17_BASE, LPUART18_BASE, LPUART19_BASE, LPUART20_BASE }
/** Array initializer of LPUART peripheral base pointers */
#define LPUART_BASE_PTRS                         { LPUART0, LPUART1, LPUART2, LPUART3, LPUART4, LPUART5, LPUART6, LPUART7, LPUART8, LPUART9, LPUART10, LPUART11, LPUART12, LPUART13, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, LPUART17, LPUART18, LPUART19, LPUART20 }
#define LPUART_RX_TX_IRQS                        { NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn }
#define LPUART_ERR_IRQS                          { NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn }


