zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT758S/MIMXRT758S_ezhv_COMMON.h
/* PKC - Peripheral instance base addresses */
/** Peripheral PKC base address */
#define PKC_BASE                                 (0x40011000u)
/** Peripheral PKC base pointer */
#define PKC                                      ((PKC_Type *)PKC_BASE)
/** Array initializer of PKC peripheral base addresses */
#define PKC_BASE_ADDRS                           { PKC_BASE }
/** Array initializer of PKC peripheral base pointers */
#define PKC_BASE_PTRS                            { PKC }

/* PMC - Peripheral instance base addresses */
/** Peripheral PMC0 base address */
#define PMC0_BASE                                (0x4020F000u)
/** Peripheral PMC0 base pointer */
#define PMC0                                     ((PMC_Type *)PMC0_BASE)
/** Peripheral PMC1 base address */
#define PMC1_BASE                                (0x40210000u)
/** Peripheral PMC1 base pointer */
#define PMC1                                     ((PMC_Type *)PMC1_BASE)
/** Array initializer of PMC peripheral base addresses */
#define PMC_BASE_ADDRS                           { PMC0_BASE, PMC1_BASE }
/** Array initializer of PMC peripheral base pointers */
#define PMC_BASE_PTRS                            { PMC0, PMC1 }

/* PNGDEC - Peripheral instance base addresses */
/** Peripheral PNGDEC base address */
#define PNGDEC_BASE                              (0x400A7000u)
/** Peripheral PNGDEC base pointer */
#define PNGDEC                                   ((PNGDEC_Type *)PNGDEC_BASE)
/** Array initializer of PNGDEC peripheral base addresses */
#define PNGDEC_BASE_ADDRS                        { PNGDEC_BASE }
/** Array initializer of PNGDEC peripheral base pointers */
#define PNGDEC_BASE_PTRS                         { PNGDEC }

/* PUF - Peripheral instance base addresses */
/** Peripheral PUF base address */
#define PUF_BASE                                 (0x40194000u)
/** Peripheral PUF base pointer */
#define PUF                                      ((PUF_Type *)PUF_BASE)
/** Peripheral PUF_ALIAS1 base address */
#define PUF_ALIAS1_BASE                          (0x40195000u)
/** Peripheral PUF_ALIAS1 base pointer */
#define PUF_ALIAS1                               ((PUF_Type *)PUF_ALIAS1_BASE)
/** Peripheral PUF_ALIAS2 base address */
#define PUF_ALIAS2_BASE                          (0x40196000u)
/** Peripheral PUF_ALIAS2 base pointer */
#define PUF_ALIAS2                               ((PUF_Type *)PUF_ALIAS2_BASE)
/** Peripheral PUF_ALIAS3 base address */
#define PUF_ALIAS3_BASE                          (0x40197000u)
/** Peripheral PUF_ALIAS3 base pointer */
#define PUF_ALIAS3                               ((PUF_Type *)PUF_ALIAS3_BASE)
/** Array initializer of PUF peripheral base addresses */
#define PUF_BASE_ADDRS                           { PUF_BASE, PUF_ALIAS1_BASE, PUF_ALIAS2_BASE, PUF_ALIAS3_BASE }
/** Array initializer of PUF peripheral base pointers */
#define PUF_BASE_PTRS                            { PUF, PUF_ALIAS1, PUF_ALIAS2, PUF_ALIAS3 }

/* PVTS - Peripheral instance base addresses */
/** Peripheral PVTS0 base address */
#define PVTS0_BASE                               (0x40005000u)
/** Peripheral PVTS0 base pointer */
#define PVTS0                                    ((PVTS_Type *)PVTS0_BASE)
/** Peripheral PVTS1 base address */
#define PVTS1_BASE                               (0x40043000u)
/** Peripheral PVTS1 base pointer */
#define PVTS1                                    ((PVTS_Type *)PVTS1_BASE)
/** Array initializer of PVTS peripheral base addresses */
#define PVTS_BASE_ADDRS                          { PVTS0_BASE, PVTS1_BASE }
/** Array initializer of PVTS peripheral base pointers */
#define PVTS_BASE_PTRS                           { PVTS0, PVTS1 }

/* RSTCTL0 - Peripheral instance base addresses */
/** Peripheral RSTCTL0 base address */
#define RSTCTL0_BASE                             (0x40000000u)
/** Peripheral RSTCTL0 base pointer */
#define RSTCTL0                                  ((RSTCTL0_Type *)RSTCTL0_BASE)
/** Array initializer of RSTCTL0 peripheral base addresses */
#define RSTCTL0_BASE_ADDRS                       { RSTCTL0_BASE }
/** Array initializer of RSTCTL0 peripheral base pointers */
#define RSTCTL0_BASE_PTRS                        { RSTCTL0 }

/* RSTCTL1 - Peripheral instance base addresses */
/** Peripheral RSTCTL1 base address */
#define RSTCTL1_BASE                             (0x40040000u)
/** Peripheral RSTCTL1 base pointer */
#define RSTCTL1                                  ((RSTCTL1_Type *)RSTCTL1_BASE)
/** Array initializer of RSTCTL1 peripheral base addresses */
#define RSTCTL1_BASE_ADDRS                       { RSTCTL1_BASE }
/** Array initializer of RSTCTL1 peripheral base pointers */
#define RSTCTL1_BASE_PTRS                        { RSTCTL1 }

/* RSTCTL2 - Peripheral instance base addresses */
/** Peripheral RSTCTL2 base address */
#define RSTCTL2_BASE                             (0x40067000u)
/** Peripheral RSTCTL2 base pointer */
#define RSTCTL2                                  ((RSTCTL2_Type *)RSTCTL2_BASE)
/** Array initializer of RSTCTL2 peripheral base addresses */
#define RSTCTL2_BASE_ADDRS                       { RSTCTL2_BASE }
/** Array initializer of RSTCTL2 peripheral base pointers */
#define RSTCTL2_BASE_PTRS                        { RSTCTL2 }

/* RSTCTL3 - Peripheral instance base addresses */
/** Peripheral RSTCTL3 base address */
#define RSTCTL3_BASE                             (0x40060000u)
/** Peripheral RSTCTL3 base pointer */
#define RSTCTL3                                  ((RSTCTL3_Type *)RSTCTL3_BASE)
/** Array initializer of RSTCTL3 peripheral base addresses */
#define RSTCTL3_BASE_ADDRS                       { RSTCTL3_BASE }
/** Array initializer of RSTCTL3 peripheral base pointers */
#define RSTCTL3_BASE_PTRS                        { RSTCTL3 }

/* RSTCTL4 - Peripheral instance base addresses */
/** Peripheral RSTCTL4 base address */
#define RSTCTL4_BASE                             (0x400A0000u)
/** Peripheral RSTCTL4 base pointer */
#define RSTCTL4                                  ((RSTCTL4_Type *)RSTCTL4_BASE)
/** Array initializer of RSTCTL4 peripheral base addresses */
#define RSTCTL4_BASE_ADDRS                       { RSTCTL4_BASE }
/** Array initializer of RSTCTL4 peripheral base pointers */
#define RSTCTL4_BASE_PTRS                        { RSTCTL4 }

/* RTC - Peripheral instance base addresses */
/** Peripheral RTC1 base address */
#define RTC1_BASE                                (0x40069000u)
/** Peripheral RTC1 base pointer */
#define RTC1                                     ((RTC_Type *)RTC1_BASE)
/** Array initializer of RTC peripheral base addresses */
#define RTC_BASE_ADDRS                           { RTC1_BASE }
/** Array initializer of RTC peripheral base pointers */
#define RTC_BASE_PTRS                            { RTC1 }

/* SCT - Peripheral instance base addresses */
/** Peripheral SCT0 base address */
#define SCT0_BASE                                (0x40114000u)
/** Peripheral SCT0 base pointer */
#define SCT0                                     ((SCT_Type *)SCT0_BASE)
/** Array initializer of SCT peripheral base addresses */
#define SCT_BASE_ADDRS                           { SCT0_BASE }
/** Array initializer of SCT peripheral base pointers */
#define SCT_BASE_PTRS                            { SCT0 }

/* SDADC - Peripheral instance base addresses */
/** Peripheral SDADC base address */
#define SDADC_BASE                               (0x4020D000u)
/** Peripheral SDADC base pointer */
#define SDADC                                    ((SDADC_Type *)SDADC_BASE)
/** Array initializer of SDADC peripheral base addresses */
#define SDADC_BASE_ADDRS                         { SDADC_BASE }
/** Array initializer of SDADC peripheral base pointers */
#define SDADC_BASE_PTRS                          { SDADC }

/* SEMA42 - Peripheral instance base addresses */
/** Peripheral SEMA42_0 base address */
#define SEMA42_0_BASE                            (0x40206000u)
/** Peripheral SEMA42_0 base pointer */
#define SEMA42_0                                 ((SEMA42_Type *)SEMA42_0_BASE)
/** Peripheral SEMA42_3 base address */
#define SEMA42_3_BASE                            (0x4031B000u)
/** Peripheral SEMA42_3 base pointer */
#define SEMA42_3                                 ((SEMA42_Type *)SEMA42_3_BASE)
/** Peripheral SEMA42_4 base address */
#define SEMA42_4_BASE                            (0x4018A000u)
/** Peripheral SEMA42_4 base pointer */
#define SEMA42_4                                 ((SEMA42_Type *)SEMA42_4_BASE)
/** Array initializer of SEMA42 peripheral base addresses */
#define SEMA42_BASE_ADDRS                        { SEMA42_0_BASE, 0u, 0u, SEMA42_3_BASE, SEMA42_4_BASE }
/** Array initializer of SEMA42 peripheral base pointers */
#define SEMA42_BASE_PTRS                         { SEMA42_0, (SEMA42_Type *)0u, (SEMA42_Type *)0u, SEMA42_3, SEMA42_4 }

/* SLEEPCON0 - Peripheral instance base addresses */
/** Peripheral SLEEPCON0 base address */
#define SLEEPCON0_BASE                           (0x40003000u)
/** Peripheral SLEEPCON0 base pointer */
#define SLEEPCON0                                ((SLEEPCON0_Type *)SLEEPCON0_BASE)
/** Array initializer of SLEEPCON0 peripheral base addresses */
#define SLEEPCON0_BASE_ADDRS                     { SLEEPCON0_BASE }
/** Array initializer of SLEEPCON0 peripheral base pointers */
#define SLEEPCON0_BASE_PTRS                      { SLEEPCON0 }

/* SLEEPCON1 - Peripheral instance base addresses */
/** Peripheral SLEEPCON1 base address */
#define SLEEPCON1_BASE                           (0x40044000u)
/** Peripheral SLEEPCON1 base pointer */
#define SLEEPCON1                                ((SLEEPCON1_Type *)SLEEPCON1_BASE)
/** Array initializer of SLEEPCON1 peripheral base addresses */
#define SLEEPCON1_BASE_ADDRS                     { SLEEPCON1_BASE }
/** Array initializer of SLEEPCON1 peripheral base pointers */
#define SLEEPCON1_BASE_PTRS                      { SLEEPCON1 }

